/*
Дано:
Таблица #Location - иерархическая 2-х уровневая таблица территориального деления, в которой ParentID ссылается на корневой элемент
Таблица #Demo - демография с привязкой через LocationID к району в таблице #LocationID
Year - год
PepCount - численность населения

Задание:
Написать запрос сводного отчета для демографии по фильтру #Location.[Name] in ( N'Aдыгея', N'Кош-Агачский район', N'Башкоркастан') и суммарным количеством населения за район в диапазоне от 30000 до 45000
Где в качестве колонок выступают года с 2010 - по 2020,
В качестве строк выступают Наименования административных единиц (#Location.ParentID is null с сортировкой от наименьшего прироста к наибольшему между значениями за 2010 и 2020 года
В качестве значений ячеек суммарное количество населения по отфильтрованным данным.
*/

create table #Location (ID int not null primary key, ParentID int, [Name] nvarchar(50) not null);
create table #Demo(ID int not null identity(1,1) primary key,LocationID int not null, [Year] int, PepCount int)
insert #Location values
	(1, null, N'Адыгея'),
	(2, null, N'Алтай'),
	(3, null, N'Башкоркастан'),
	(11,1,N'Гиагинский район'),
	(12,1,N'Кошехабльский район'),
	(21,2,N'Кош-Агачский район'),
	(22,2,N'Майминский район'),
	(31,3,N'Абзелиловский район'),
	(32,3,N'Альшеевский район')




insert #Demo (LocationID, [Year], PepCount) values
	 (11, 2010, 31766),
	 (11, 2011, 31768),
	 (11, 2012, 31731),
	 (11, 2013, 31390),
	 (11, 2014, 31213),
	 (11, 2015, 31186),
	 (11, 2016, 31185),
	 (11, 2017, 31278),
	 (11, 2018, 31394),
	 (11, 2019, 31572),
	 (11, 2020, 31971),

	 (12, 2010, 30422),
	 (12, 2011, 30424),
	 (12, 2012, 30359),
	 (12, 2013, 30317),
	 (12, 2014, 30180),
	 (12, 2015, 30117),
	 (12, 2016, 29968),
	 (12, 2017, 29886),
	 (12, 2018, 29726),
	 (12, 2019, 29497),
	 (12, 2020, 29569),

	 (21, 2010, 18263),
	 (21, 2011, 18263),
	 (21, 2012, 18263),
	 (21, 2013, 18318),
	 (21, 2014, 18599),
	 (21, 2015, 18765),
	 (21, 2016, 18814),
	 (21, 2017, 19025),
	 (21, 2018, 19188),
	 (21, 2019, 19188),
	 (21, 2020, 19188),

	 (22, 2010, 28642),
	 (22, 2011, 28667),
	 (22, 2012, 28867),
	 (22, 2013, 29397),
	 (22, 2014, 30050),
	 (22, 2015, 31113),
	 (22, 2016, 31932),
	 (22, 2017, 33042),
	 (22, 2018, 33939),
	 (22, 2019, 33940),
	 (22, 2020, 33939),

	 (31, 2010, 45551),
	 (31, 2011, 45551),
	 (31, 2012, 45484),
	 (31, 2013, 45227),
	 (31, 2014, 45042),
	 (31, 2015, 44795),
	 (31, 2016, 44888),
	 (31, 2017, 44962),
	 (31, 2018, 44900),
	 (31, 2019, 44862),
	 (31, 2020, 44700),

	 (32, 2010, 43647),
	 (32, 2011, 43646),
	 (32, 2012, 42454),
	 (32, 2013, 41551),
	 (32, 2014, 40747),
	 (32, 2015, 39880),
	 (32, 2016, 39420),
	 (32, 2017, 38874),
	 (32, 2018, 38386),
	 (32, 2019, 37615),
	 (32, 2020, 36823);



--	 drop table #Demo
--	 drop table #Location